ci4/app/Controllers/Artikel.php

    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $q = $this->request->getVar('q') ?? '';
        $model = new ArtikelModel();
        $data = [
            'title' => $title,
            'q' => $q,
            'artikel' => $model->like('judul', $q)->paginate(5), # data dibatasi 10 record per halaman
---
SELECT *
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'

    public function add()
{
// validasi data.
$validation = \Config\Services::validation();
$validation->setRules(['judul' => 'required']);
$isDataValid = $validation->withRequest($this->request)->run();
if ($isDataValid)
{
$file = $this->request->getFile('gambar');
$file->move(ROOTPATH . 'public/gambar');
$artikel = new ArtikelModel();
$artikel->insert([
'judul' => $this->request->getPost('judul'),
'isi' => $this->request->getPost('isi'),
'slug' => url_title($this->request->getPost('judul')),
'gambar' => $file->getName(),
]);
---
INSERT INTO `artikel` (`judul`, `isi`, `slug`, `gambar`) VALUES ('Artikel Kesebelas', 'Lorem Ipsum adalah contoh teks atau dummy dalam\r\nindustri percetakan dan penataan huruf atau typesetting. Lorem Ipsum telah\r\nmenjadi standar contoh teks sejak tahun 1500an, saat seorang tukang cetak\r\nyang tidak dikenal mengambil sebuah kumpulan teks dan mengacaknya untuk\r\nmenjadi sebuah buku contoh huruf.', 'Artikel-Kesebelas', 'kucing_5.jpg')